# CM3 Pandas Opdrachten

In dit notebook vind je de volgende opdrachten
- [Opdracht 1 - Series](#Opdracht-1-Series)
- [Opdracht 2 - Dataframe](#Opdracht-2-Dataframe)
- [Opdracht 3 - Cijfers](#Opdracht-3-Cijfers)
- [Opdracht 4 - datetime](#Opdracht-4-datetime)

## Opdracht 1 Series

In [629]:
import pandas as pd
import numpy as np

In [630]:
#values = [7.0, 6.5, 9.0, 8.0]
#index = [ 'DS', 'IAC', 'NET', 'IAC']
values = [7.0, 6.5, 9.0]
index = [ 'DS', 'IAC', 'NET']
cijfers = pd.Series(values, index=index)
cijfers

DS     7.0
IAC    6.5
NET    9.0
dtype: float64

- Haal het cijfer 6.5 op uit de Series door middel van:
  1. de expliciete key methode
  2. de impliciete key methode
  3. rechtstreeks met de expliciete key
  4. rechtstreeks met de impliciete key

In [631]:
print("1. ", cijfers.loc['IAC'])
print("2. ", cijfers.iloc[1])
print("3. ", cijfers['IAC'])
print("4. ", cijfers[1])

1.  6.5
2.  6.5
3.  6.5
4.  6.5

/tmp/ipykernel_703733/1806157625.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print("4. ", cijfers[1])

- Retourneer de cijfers van de laatste twee vakken uit de Series.

In [632]:
cijfers[1:3] # Ik denk dat doet word bedoeld?

IAC    6.5
NET    9.0
dtype: float64

- Bepaal gemiddelde, mediaan, minimum en maximum van de cijfers.

In [633]:
print("average: ", cijfers.mean())
print("median: ", cijfers.median())
print("min: ", cijfers.min())
print("max: ", cijfers.max())

average:  7.5
median:  7.0
min:  6.5
max:  9.0

## Opdracht 2 Dataframe

In [634]:
student1 = pd.Series({'Nummer':'s1', 'Naam':'Joop', 'Tentamen':99.9, 'Opdracht': 7.5})
student2 = pd.Series({'Nummer':'s2', 'Naam':'Piet', 'Tentamen':8.0, 'Opdracht': 7.0})
student3 = pd.Series({'Nummer': None, 'Naam':'Fout', 'Tentamen':99.9, 'Opdracht': 99.9})
student4 = pd.Series({'Nummer':'s3', 'Naam':'Kees', 'Tentamen':4.0, 'Opdracht': 6.0})
studenten = pd.DataFrame([student1, student2,student3, student4])
studenten

  Nummer  Naam  Tentamen  Opdracht
0     s1  Joop      99.9       7.5
1     s2  Piet       8.0       7.0
2   None  Fout      99.9      99.9
3     s3  Kees       4.0       6.0

- Bepaal het totaal aantal niet-bestaande waarden.

In [635]:
studenten.isnull().sum() # Is dit wat er bedoeld word? Of moet de waarde "fout" ook meegeteld worden?

Nummer      1
Naam        0
Tentamen    0
Opdracht    0
dtype: int64

- Zet de opdracht- en tentamencijfers met waarde 99.9 om naar NaN waarde

In [636]:
studenten.replace(99.9, np.nan, inplace=True)
studenten

  Nummer  Naam  Tentamen  Opdracht
0     s1  Joop       NaN       7.5
1     s2  Piet       8.0       7.0
2   None  Fout       NaN       NaN
3     s3  Kees       4.0       6.0

- Haal de missing values uit het DataFrame

In [637]:
studenten.dropna(inplace=True) # Moet de hele rij verwijderd worden of alleen de value met NaN? En zo ja wat moet er komen?
studenten

  Nummer  Naam  Tentamen  Opdracht
1     s2  Piet       8.0       7.0
3     s3  Kees       4.0       6.0

- Zet `Nummer` als index.

In [638]:
studenten.set_index('Nummer', inplace=True)
studenten

        Naam  Tentamen  Opdracht
Nummer
s2      Piet       8.0       7.0
s3      Kees       4.0       6.0

- Het eindcijfer van het vak is 70% tentamen en 30% opdracht; voeg dit als kolom `Eindcijfer` toe

In [639]:
eindcijfer = studenten['Tentamen'] * 0.7 + studenten['Opdracht'] * 0.3
studenten['Eindcijfer'] = eindcijfer

- Bepaal het gemiddelde eindcijfer

In [640]:
studenten.Eindcijfer.mean()

np.float64(6.1499999999999995)

- Wat geeft `studenten.describe()` weer?

In [641]:
studenten.describe()

       Tentamen  Opdracht  Eindcijfer
count  2.000000  2.000000    2.000000
mean   6.000000  6.500000    6.150000
std    2.828427  0.707107    2.192031
min    4.000000  6.000000    4.600000
25%    5.000000  6.250000    5.375000
50%    6.000000  6.500000    6.150000
75%    7.000000  6.750000    6.925000
max    8.000000  7.000000    7.700000

- Selecteer alle namen en cijfers van de studenten met een voldoende als eindcijfer.

In [642]:
print(studenten[studenten['Eindcijfer'] >= 5.5])

        Naam  Tentamen  Opdracht  Eindcijfer
Nummer
s2      Piet       8.0       7.0         7.7

## Opdracht 3 Cijfers

Numpy arrays kunnen alleen uniforme waarden bevatten. Pandas arrays kunnen juist meer bevatten. We doen de opdracht in numpy nu in pandas. Tip: maak gebruik van de cheat sheets!

Aanvullende bron:
-	http://nbviewer.jupyter.org/github/justmarkham/pandas-videos/blob/master/pandas.ipynb

De blokcoördinator D.O. Cent van blok A, SIE-V2  wil graag de cijfers analyseren en verwerken. het blok bestaat uit 3 vakken, die door 10 studenten gevolgd zijn. Analyse omvat o.a. het bepalen van gemiddelde cijfer, het aantal voldoendes en cursusrendement. De verwerking bestaat uit het corrigeren van de cijfers. 


In `blokAcijfers.txt` staan de cijfers per vak (naast elkaar staan de vakken, onder elkaar de studenten):

vak1 | vak2 | vak3
----|-------|------
6.5 | 7.3   | 6.4
8.0 | 8.0	| 8.5
3.2	| 4.0	| 5.0
7.9	| 7.1	| 3.5
7.3	| 7.8	| 8.0
8.6	| 8.0	| 9.0
4.0	| 6.0	| 5.5
7.3	| 7.8	| 7.8
4.5	| 5.6	| 7.7
5.0	| 7.0	| 7.2

In `blokAStudenten.csv` staan de studentgegevens:

"Studentnr"|"Naam"|"Vooropleiding"
--|--|--
1502000|"Jan Jansen"|"HAVO"
1501677|"Ali ElMoune"|"MBO"
1503190|"Bert de Graaf"|"HAVO"
1506700|"Koos Alberts"|"MBO"
1504503|"Willie Napoli"|"MBO"
1507878|"Jorrit Beeks"|"VWO"
1502507|"Frits Wielenga"|"HAVO"
1503684|"Cornee Nijsten"|"VWO"
1503831|"Sabine Honing"|"HAVO"
1506001|"George Belfore"|"HAVO"

In [643]:
# Deze imports zijn nodig voor de opdracht.
import pandas as pd
import numpy as np

De docent wil de gegevens in een Jupyter Notebook verwerken.
-	Lees tekstbestand: blokAcijfers.txt in, in een dataframe `cijfers`.
-	Laat zien dat de gegevens goed ingelezen zijn.
-	Wijzig de kolomnrs in de vaknamen: vakken = ['RAD','ANA', CBA'].
-	Toon de dataframe attributen.
-	Toon de index gegevens.

In [644]:
columns = ['RAD', 'ANA', 'CBA']
cijfers = pd.read_csv('blokAcijfers.txt', sep='\t', names=columns)
print(cijfers)

   RAD  ANA  CBA
0  6.5  7.3  6.4
1  8.0  8.0  8.5
2  3.2  4.0  5.0
3  7.9  7.1  3.5
4  7.3  7.8  8.0
5  8.6  8.0  9.0
6  4.0  6.0  5.5
7  7.3  7.8  7.8
8  4.5  5.6  7.7
9  5.0  7.0  7.2

De docent ziet dat er 2 cijfers fout zijn en wil deze corrigeren (NB. Elke regel heeft een numeriek index gelijk aan het regelnummer.)
-	 Wijzig de volgende cijfers							
    *	vak-2, student-3  cijfer 4.0 moet 4.3 worden.
    *	vak-1, student-10, cijfer 5.0 moet 4.8 worden.

In [645]:
cijfers.loc[2, 'ANA'] = 4.3
cijfers.loc[9, 'RAD'] = 4.8
print(cijfers)

   RAD  ANA  CBA
0  6.5  7.3  6.4
1  8.0  8.0  8.5
2  3.2  4.3  5.0
3  7.9  7.1  3.5
4  7.3  7.8  8.0
5  8.6  8.0  9.0
6  4.0  6.0  5.5
7  7.3  7.8  7.8
8  4.5  5.6  7.7
9  4.8  7.0  7.2

De docent wil de studentgegevens ook aan het dataframe toevoegen.
-	Lees tekstbestand: `blokAStudenten.csv` in, in een dataframe `studenten`. Let op dat je de juiste instellingen voor sep en header meegeeft.
-	Laat zien dat de gegevens correct zijn ingelezen.

In [646]:
studenten = pd.read_csv('blokAStudenten.csv', sep=';')
print(studenten)

   Studentnr            Naam Vooropleiding
0    1502000      Jan Jansen          HAVO
1    1501677     Ali ElMoune           MBO
2    1503190   Bert de Graaf          HAVO
3    1506700    Koos Alberts           MBO
4    1504503   Willie Napoli           MBO
5    1507878    Jorrit Beeks           VWO
6    1502507  Frits Wielenga          HAVO
7    1503684  Cornee Nijsten           VWO
8    1503831   Sabine Honing          HAVO
9    1506001  George Belfore          HAVO

Nu gaan we ``studenten`` en ``cijfers`` samenvoegen tot een cijferslijst. We mogen er vanuitgaan dat de volgorde van beiden dezelfde index hebben (hier de rijwaarde 0 t/m 9).
-	Combineer de beide dataframes met behulp van `p.merge()`:
    *	Je kunt hier een inner join gebruiken.
    *	Je kunt van beide zijden de index gebruiken .
-	Laat zien dat de gegevens correct zijn samengevoegd tot één dataframe cijferlijst met de kolommen: `Studentnr`; `Naam`; `Vooropleiding`; `RAD`; `ANA`; en `CBA`.

In [647]:
cijferlijst = studenten.merge(cijfers, left_index=True, right_index=True)
print(cijferlijst)

   Studentnr            Naam Vooropleiding  RAD  ANA  CBA
0    1502000      Jan Jansen          HAVO  6.5  7.3  6.4
1    1501677     Ali ElMoune           MBO  8.0  8.0  8.5
2    1503190   Bert de Graaf          HAVO  3.2  4.3  5.0
3    1506700    Koos Alberts           MBO  7.9  7.1  3.5
4    1504503   Willie Napoli           MBO  7.3  7.8  8.0
5    1507878    Jorrit Beeks           VWO  8.6  8.0  9.0
6    1502507  Frits Wielenga          HAVO  4.0  6.0  5.5
7    1503684  Cornee Nijsten           VWO  7.3  7.8  7.8
8    1503831   Sabine Honing          HAVO  4.5  5.6  7.7
9    1506001  George Belfore          HAVO  4.8  7.0  7.2

Het is handig om een dataframe een sprekende index te geven:
-	Maak `Studentnr` de rij-index. NB. Gebruik indien nodig de optie `inplace=True`.

In [648]:
cijferlijst.set_index("Studentnr", inplace=True)
print(cijferlijst)

                     Naam Vooropleiding  RAD  ANA  CBA
Studentnr
1502000        Jan Jansen          HAVO  6.5  7.3  6.4
1501677       Ali ElMoune           MBO  8.0  8.0  8.5
1503190     Bert de Graaf          HAVO  3.2  4.3  5.0
1506700      Koos Alberts           MBO  7.9  7.1  3.5
1504503     Willie Napoli           MBO  7.3  7.8  8.0
1507878      Jorrit Beeks           VWO  8.6  8.0  9.0
1502507    Frits Wielenga          HAVO  4.0  6.0  5.5
1503684    Cornee Nijsten           VWO  7.3  7.8  7.8
1503831     Sabine Honing          HAVO  4.5  5.6  7.7
1506001    George Belfore          HAVO  4.8  7.0  7.2

De docent wil wat basisgegevens: minimum, maximum, gemiddelde van de cijfers weten. Het grote voordeel is dat numpy heel goed kan omgaan met de numerieke kolommen van een dataframe. Voorbeeld: het berekenen van het gemiddelde cijfer voor het vak ‘RAD’ kan met de opdracht: `np.mean(cijferlijst['RAD']`.
-	Bepaal minimum, maximum en gemiddelde van alle cijfers.
-	Bepaal minimum, maximum en gemiddelde van elk vak (3 getallen).
-	Bepaal minimum, maximum en gemiddelde van elke student (10 getallen).

In [649]:
print("Min All", cijferlijst.loc[:, "RAD":"CBA"].min().min())
print("Max All", cijferlijst.loc[:, "RAD":"CBA"].max().max())
print("Mean All", cijferlijst.loc[:, "RAD":"CBA"].mean().mean())

print("Min\n", cijferlijst.loc[:, "RAD":"CBA"].min())  
print("Max\n", cijferlijst.loc[:, "RAD":"CBA"].max())
print("Mean\n", cijferlijst.loc[:, "RAD":"CBA"].mean())

print("Min per student\n", cijferlijst.loc[:, "RAD":"CBA"].min(axis=1))
print("Max per student\n", cijferlijst.loc[:, "RAD":"CBA"].max(axis=1))
print("Mean per student\n", cijferlijst.loc[:, "RAD":"CBA"].mean(axis=1))

Min All 3.2
Max All 9.0
Mean All 6.653333333333333
Min
 RAD    3.2
ANA    4.3
CBA    3.5
dtype: float64
Max
 RAD    8.6
ANA    8.0
CBA    9.0
dtype: float64
Mean
 RAD    6.21
ANA    6.89
CBA    6.86
dtype: float64
Min per student
 Studentnr
1502000    6.4
1501677    8.0
1503190    3.2
1506700    3.5
1504503    7.3
1507878    8.0
1502507    4.0
1503684    7.3
1503831    4.5
1506001    4.8
dtype: float64
Max per student
 Studentnr
1502000    7.3
1501677    8.5
1503190    5.0
1506700    7.9
1504503    8.0
1507878    9.0
1502507    6.0
1503684    7.8
1503831    7.7
1506001    7.2
dtype: float64
Mean per student
 Studentnr
1502000    6.733333
1501677    8.166667
1503190    4.166667
1506700    6.166667
1504503    7.700000
1507878    8.533333
1502507    5.166667
1503684    7.633333
1503831    5.933333
1506001    6.333333
dtype: float64

Er is een fout gemaakt bij de cijfers van het 1e vak (RAD). Iedere student krijgt 0.5 punt extra erbij.
-	Doe dit met één opdrachtregel.

In [650]:
cijferlijst["RAD"] = cijferlijst["RAD"] + 0.5
print(cijferlijst)

                     Naam Vooropleiding  RAD  ANA  CBA
Studentnr
1502000        Jan Jansen          HAVO  7.0  7.3  6.4
1501677       Ali ElMoune           MBO  8.5  8.0  8.5
1503190     Bert de Graaf          HAVO  3.7  4.3  5.0
1506700      Koos Alberts           MBO  8.4  7.1  3.5
1504503     Willie Napoli           MBO  7.8  7.8  8.0
1507878      Jorrit Beeks           VWO  9.1  8.0  9.0
1502507    Frits Wielenga          HAVO  4.5  6.0  5.5
1503684    Cornee Nijsten           VWO  7.8  7.8  7.8
1503831     Sabine Honing          HAVO  5.0  5.6  7.7
1506001    George Belfore          HAVO  5.3  7.0  7.2

De docent wil graag weten of er verschil in studentprestaties is afhankelijk van de vooropleiding. 
-	Toon voor elk vak het vooropleiding groepsgemiddelde.
-	Wat is je conclusie ?

In [651]:
havo = cijferlijst[cijferlijst['Vooropleiding'] == 'HAVO']
vwo = cijferlijst[cijferlijst['Vooropleiding'] == 'VWO']
mbo = cijferlijst[cijferlijst['Vooropleiding'] == 'MBO']

print("VWO\n", vwo.loc[:, "RAD":"CBA"].mean())
print("HAVO\n", havo.loc[:, "RAD":"CBA"].mean())
print("MBO\n", mbo.loc[:, "RAD":"CBA"].mean())

VWO
 RAD    8.45
ANA    7.90
CBA    8.40
dtype: float64
HAVO
 RAD    5.10
ANA    6.04
CBA    6.36
dtype: float64
MBO
 RAD    8.233333
ANA    7.633333
CBA    6.666667
dtype: float64

Conclusie: Havo dit het aanzienlijk minder dan zowel MBO als VWO. Voornamelijk in RAD en ANA.

## Opdracht 4 datetime

Maak een Jupyter notebook waarin je met Pandas de volgende casus realiseert: een storingsmedewerker wil graag onderzoeken hoe het weer geweest is op 1 Januari 2017. Hiervoor vraagt hij bij het KNMI de weergegevens op van drie meetstations.

Aanvullende bronnen:
- http://chrisalbon.com/python/pandas_time_series_basics.html
- http://chrisalbon.com/python/date_and_time_basics.html
- http://chrisalbon.com/python/pandas_group_by_time.html

In [652]:
# Aanvullende imports
import datetime as dt
import matplotlib.pyplot as pyplot

# De data die we gaan gebruiken.
data = {'meetpunt': ['De Bilt','Maastricht', 'Leeuwarden',
                     'De Bilt','Maastricht', 'Leeuwarden',
                     'De Bilt','Maastricht', 'Leeuwarden',
                     'De Bilt','Maastricht', 'Leeuwarden'],
        'datum': ['2017-01-01 13:00:05.069722', '2017-01-01 13:00:01.119994', '2017-01-01 13:00:07.178768',
                  '2017-01-02 13:00:01.043200', '2017-01-02 13:00:03.119401', '2017-01-02 13:00:03.876898',
                  '2017-01-03 13:00:03.043450', '2017-01-03 13:00:02.669401', '2017-01-03 13:00:01.321898',
                  '2017-01-04 13:00:04.042015', '2017-01-04 13:00:04.321564', '2017-01-04 13:00:04.394866'],
        'temperatuur': [-0.3, 1.9, 0.8,
                        1.8, 7.1, 5.7,
                        2.9, 7.3, 5.1,
                        0.1, 6.8, 2.1,]}

Bewerk de data zodat deze netjes in een dataframe komt.
-	Maak een dataframe met kolommen: ‘datum’, ‘temperatuur, ‘meetpunt’.
-	Maak van de datum kolom een kolom met datatype datetime.

In [653]:
import pandas as pd

df = pd.DataFrame(data)
df['datum'] = pd.to_datetime(df['datum'])

Doe de volgende analyse op de datum gegevens.
-	Haal de eerste datumwaarde uit de tabel.
-	Bepaal van de eerste datumwaarden: jaar, maand, dag, uur, minuut en seconde.
-	Bepaal het tijdsverschil tussen de 1e en laatste waarde.
-	Bepaal van het tijdsverschil het aantal dagen.
-	Bepaal van het tijdsverschil het aantal uren.

In [654]:
df.sort_values(by="datum").iloc[0]
print("Earliest occurance:\n", df.iloc[0])
print("Date: ", df.iloc[0]["datum"].strftime("%Y-%m-%d %H:%M:%S"))
time_diff = df.iloc[-1]["datum"] - df.iloc[0]["datum"]
print("Time differance days", time_diff.days)
print("Time differance hours", time_diff.days*24 + time_diff.seconds//3600)

Earliest occurance:
 meetpunt                          De Bilt
datum          2017-01-01 13:00:05.069722
temperatuur                          -0.3
Name: 0, dtype: object
Date:  2017-01-01 13:00:05
Time differance days 2
Time differance hours 71

De storingsmedewerker wil graag de volgende gegevens van dagen. Daarom is het handig om de dataframe te voorzien van een index. Voer dan de volgende opdrachten uit en verklaar deze.
-	Maak van de datum kolom een index.
-	De temperaturen op 1 januari.
-	De temperaturen na 3 januari.
-	De temperatuur gemiddeld per dag .
-	Leg nu zelf uit wat de functie shift() doet.
-	Haal de datum kolom index weer weg.

In [655]:
df.set_index('datum', inplace=True)
print("1 januari:\n ", df.loc['2017-01-01', "temperatuur"])
print("3 januari of later: \n", df.loc[df.loc['2017-01-03', "temperatuur"].first_valid_index():])

print("Average temperature per day:\n", df.groupby(df.index.date)['temperatuur'].mean())

# Heb geen shift functie gebruikt? Maar met de shift kan je eventuele data ranges op een bepaalde value zettem

df.reset_index(inplace=True)

1 januari:
  datum
2017-01-01 13:00:05.069722   -0.3
2017-01-01 13:00:01.119994    1.9
2017-01-01 13:00:07.178768    0.8
Name: temperatuur, dtype: float64
3 januari of later:
                               meetpunt  temperatuur
datum
2017-01-03 13:00:03.043450     De Bilt          2.9
2017-01-03 13:00:02.669401  Maastricht          7.3
2017-01-03 13:00:01.321898  Leeuwarden          5.1
2017-01-04 13:00:04.042015     De Bilt          0.1
2017-01-04 13:00:04.321564  Maastricht          6.8
2017-01-04 13:00:04.394866  Leeuwarden          2.1
Average temperature per day:
 2017-01-01    0.800000
2017-01-02    4.866667
2017-01-03    5.100000
2017-01-04    3.000000
Name: temperatuur, dtype: float64

df.set_index('datum', inplace=True)
print(df.loc[pd.DatetimeIndex(["2017-01-01"]), ])